; domain
(define (domain transport-strips)
(:requirements :typing :action-costs)

(:types location fuellevel locatable - object 
	package truck - locatable
)

(:predicates 
(connected ?l1 ?l2 - location)
(at ?o - locatable ?l - location)
(in ?p - package ?t - truck)
(fuel ?t - truck ?level - fuellevel)
(fuelcost ?level - fuellevel ?l1 ?l2 - location)
(sum ?a ?b ?c - fuellevel)
)

(:functions 
(total-cost) - number)

(:action LOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (at ?p ?l))
:effect
(and (not (at ?p ?l)) (in ?p ?t) (increase (total-cost) 1))
)

(:action UNLOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (in ?p ?t))
:effect
(and (at ?p ?l) (not (in ?p ?t)) (increase (total-cost) 1))
)

(:action DRIVE
:parameters
(?t - truck
?l1 - location
?l2 - location
?fuelpost - fuellevel
?fueldelta - fuellevel
?fuelpre - fuellevel)
:precondition
(and 
(connected ?l1 ?l2)
(fuelcost ?fueldelta ?l1 ?l2)
(fuel ?t ?fuelpre)
(sum ?fuelpost ?fueldelta ?fuelpre)
(at ?t ?l1)
)
:effect
(and (not (at ?t ?l1)) 
     (at ?t ?l2) 
     (not (fuel ?t ?fuelpre)) 
     (fuel ?t ?fuelpost)
     (increase (total-cost) 1))
)

)

; problem
(define (problem transport-l5-t1-p11---int100n150-m25---int100c110---s208---e0)
(:domain transport-strips)

(:objects
l0 l1 l2 l3 l4 - location
t0 - truck
p0 p1 p2 p3 p4 p5 p6 p7 p8 p9 p10 - package
level0 level1 level2 level3 level4 level5 level6 level7 level8 level9 level10 level11 level12 level13 level14 level15 level16 level17 level18 level19 level20 level21 level22 level23 level24 level25 level26 level27 level28 level29 level30 level31 level32 level33 level34 level35 level36 level37 level38 level39 level40 level41 level42 level43 level44 level45 level46 level47 level48 level49 level50 level51 level52 level53 level54 level55 level56 level57 level58 level59 level60 level61 level62 level63 level64 level65 level66 level67 level68 - fuellevel
)

(:init
(sum level0 level4 level4)
(sum level0 level5 level5)
(sum level0 level6 level6)
(sum level0 level7 level7)
(sum level0 level16 level16)
(sum level0 level17 level17)
(sum level0 level21 level21)
(sum level1 level4 level5)
(sum level1 level5 level6)
(sum level1 level6 level7)
(sum level1 level7 level8)
(sum level1 level16 level17)
(sum level1 level17 level18)
(sum level1 level21 level22)
(sum level2 level4 level6)
(sum level2 level5 level7)
(sum level2 level6 level8)
(sum level2 level7 level9)
(sum level2 level16 level18)
(sum level2 level17 level19)
(sum level2 level21 level23)
(sum level3 level4 level7)
(sum level3 level5 level8)
(sum level3 level6 level9)
(sum level3 level7 level10)
(sum level3 level16 level19)
(sum level3 level17 level20)
(sum level3 level21 level24)
(sum level4 level4 level8)
(sum level4 level5 level9)
(sum level4 level6 level10)
(sum level4 level7 level11)
(sum level4 level16 level20)
(sum level4 level17 level21)
(sum level4 level21 level25)
(sum level5 level4 level9)
(sum level5 level5 level10)
(sum level5 level6 level11)
(sum level5 level7 level12)
(sum level5 level16 level21)
(sum level5 level17 level22)
(sum level5 level21 level26)
(sum level6 level4 level10)
(sum level6 level5 level11)
(sum level6 level6 level12)
(sum level6 level7 level13)
(sum level6 level16 level22)
(sum level6 level17 level23)
(sum level6 level21 level27)
(sum level7 level4 level11)
(sum level7 level5 level12)
(sum level7 level6 level13)
(sum level7 level7 level14)
(sum level7 level16 level23)
(sum level7 level17 level24)
(sum level7 level21 level28)
(sum level8 level4 level12)
(sum level8 level5 level13)
(sum level8 level6 level14)
(sum level8 level7 level15)
(sum level8 level16 level24)
(sum level8 level17 level25)
(sum level8 level21 level29)
(sum level9 level4 level13)
(sum level9 level5 level14)
(sum level9 level6 level15)
(sum level9 level7 level16)
(sum level9 level16 level25)
(sum level9 level17 level26)
(sum level9 level21 level30)
(sum level10 level4 level14)
(sum level10 level5 level15)
(sum level10 level6 level16)
(sum level10 level7 level17)
(sum level10 level16 level26)
(sum level10 level17 level27)
(sum level10 level21 level31)
(sum level11 level4 level15)
(sum level11 level5 level16)
(sum level11 level6 level17)
(sum level11 level7 level18)
(sum level11 level16 level27)
(sum level11 level17 level28)
(sum level11 level21 level32)
(sum level12 level4 level16)
(sum level12 level5 level17)
(sum level12 level6 level18)
(sum level12 level7 level19)
(sum level12 level16 level28)
(sum level12 level17 level29)
(sum level12 level21 level33)
(sum level13 level4 level17)
(sum level13 level5 level18)
(sum level13 level6 level19)
(sum level13 level7 level20)
(sum level13 level16 level29)
(sum level13 level17 level30)
(sum level13 level21 level34)
(sum level14 level4 level18)
(sum level14 level5 level19)
(sum level14 level6 level20)
(sum level14 level7 level21)
(sum level14 level16 level30)
(sum level14 level17 level31)
(sum level14 level21 level35)
(sum level15 level4 level19)
(sum level15 level5 level20)
(sum level15 level6 level21)
(sum level15 level7 level22)
(sum level15 level16 level31)
(sum level15 level17 level32)
(sum level15 level21 level36)
(sum level16 level4 level20)
(sum level16 level5 level21)
(sum level16 level6 level22)
(sum level16 level7 level23)
(sum level16 level16 level32)
(sum level16 level17 level33)
(sum level16 level21 level37)
(sum level17 level4 level21)
(sum level17 level5 level22)
(sum level17 level6 level23)
(sum level17 level7 level24)
(sum level17 level16 level33)
(sum level17 level17 level34)
(sum level17 level21 level38)
(sum level18 level4 level22)
(sum level18 level5 level23)
(sum level18 level6 level24)
(sum level18 level7 level25)
(sum level18 level16 level34)
(sum level18 level17 level35)
(sum level18 level21 level39)
(sum level19 level4 level23)
(sum level19 level5 level24)
(sum level19 level6 level25)
(sum level19 level7 level26)
(sum level19 level16 level35)
(sum level19 level17 level36)
(sum level19 level21 level40)
(sum level20 level4 level24)
(sum level20 level5 level25)
(sum level20 level6 level26)
(sum level20 level7 level27)
(sum level20 level16 level36)
(sum level20 level17 level37)
(sum level20 level21 level41)
(sum level21 level4 level25)
(sum level21 level5 level26)
(sum level21 level6 level27)
(sum level21 level7 level28)
(sum level21 level16 level37)
(sum level21 level17 level38)
(sum level21 level21 level42)
(sum level22 level4 level26)
(sum level22 level5 level27)
(sum level22 level6 level28)
(sum level22 level7 level29)
(sum level22 level16 level38)
(sum level22 level17 level39)
(sum level22 level21 level43)
(sum level23 level4 level27)
(sum level23 level5 level28)
(sum level23 level6 level29)
(sum level23 level7 level30)
(sum level23 level16 level39)
(sum level23 level17 level40)
(sum level23 level21 level44)
(sum level24 level4 level28)
(sum level24 level5 level29)
(sum level24 level6 level30)
(sum level24 level7 level31)
(sum level24 level16 level40)
(sum level24 level17 level41)
(sum level24 level21 level45)
(sum level25 level4 level29)
(sum level25 level5 level30)
(sum level25 level6 level31)
(sum level25 level7 level32)
(sum level25 level16 level41)
(sum level25 level17 level42)
(sum level25 level21 level46)
(sum level26 level4 level30)
(sum level26 level5 level31)
(sum level26 level6 level32)
(sum level26 level7 level33)
(sum level26 level16 level42)
(sum level26 level17 level43)
(sum level26 level21 level47)
(sum level27 level4 level31)
(sum level27 level5 level32)
(sum level27 level6 level33)
(sum level27 level7 level34)
(sum level27 level16 level43)
(sum level27 level17 level44)
(sum level27 level21 level48)
(sum level28 level4 level32)
(sum level28 level5 level33)
(sum level28 level6 level34)
(sum level28 level7 level35)
(sum level28 level16 level44)
(sum level28 level17 level45)
(sum level28 level21 level49)
(sum level29 level4 level33)
(sum level29 level5 level34)
(sum level29 level6 level35)
(sum level29 level7 level36)
(sum level29 level16 level45)
(sum level29 level17 level46)
(sum level29 level21 level50)
(sum level30 level4 level34)
(sum level30 level5 level35)
(sum level30 level6 level36)
(sum level30 level7 level37)
(sum level30 level16 level46)
(sum level30 level17 level47)
(sum level30 level21 level51)
(sum level31 level4 level35)
(sum level31 level5 level36)
(sum level31 level6 level37)
(sum level31 level7 level38)
(sum level31 level16 level47)
(sum level31 level17 level48)
(sum level31 level21 level52)
(sum level32 level4 level36)
(sum level32 level5 level37)
(sum level32 level6 level38)
(sum level32 level7 level39)
(sum level32 level16 level48)
(sum level32 level17 level49)
(sum level32 level21 level53)
(sum level33 level4 level37)
(sum level33 level5 level38)
(sum level33 level6 level39)
(sum level33 level7 level40)
(sum level33 level16 level49)
(sum level33 level17 level50)
(sum level33 level21 level54)
(sum level34 level4 level38)
(sum level34 level5 level39)
(sum level34 level6 level40)
(sum level34 level7 level41)
(sum level34 level16 level50)
(sum level34 level17 level51)
(sum level34 level21 level55)
(sum level35 level4 level39)
(sum level35 level5 level40)
(sum level35 level6 level41)
(sum level35 level7 level42)
(sum level35 level16 level51)
(sum level35 level17 level52)
(sum level35 level21 level56)
(sum level36 level4 level40)
(sum level36 level5 level41)
(sum level36 level6 level42)
(sum level36 level7 level43)
(sum level36 level16 level52)
(sum level36 level17 level53)
(sum level36 level21 level57)
(sum level37 level4 level41)
(sum level37 level5 level42)
(sum level37 level6 level43)
(sum level37 level7 level44)
(sum level37 level16 level53)
(sum level37 level17 level54)
(sum level37 level21 level58)
(sum level38 level4 level42)
(sum level38 level5 level43)
(sum level38 level6 level44)
(sum level38 level7 level45)
(sum level38 level16 level54)
(sum level38 level17 level55)
(sum level38 level21 level59)
(sum level39 level4 level43)
(sum level39 level5 level44)
(sum level39 level6 level45)
(sum level39 level7 level46)
(sum level39 level16 level55)
(sum level39 level17 level56)
(sum level39 level21 level60)
(sum level40 level4 level44)
(sum level40 level5 level45)
(sum level40 level6 level46)
(sum level40 level7 level47)
(sum level40 level16 level56)
(sum level40 level17 level57)
(sum level40 level21 level61)
(sum level41 level4 level45)
(sum level41 level5 level46)
(sum level41 level6 level47)
(sum level41 level7 level48)
(sum level41 level16 level57)
(sum level41 level17 level58)
(sum level41 level21 level62)
(sum level42 level4 level46)
(sum level42 level5 level47)
(sum level42 level6 level48)
(sum level42 level7 level49)
(sum level42 level16 level58)
(sum level42 level17 level59)
(sum level42 level21 level63)
(sum level43 level4 level47)
(sum level43 level5 level48)
(sum level43 level6 level49)
(sum level43 level7 level50)
(sum level43 level16 level59)
(sum level43 level17 level60)
(sum level43 level21 level64)
(sum level44 level4 level48)
(sum level44 level5 level49)
(sum level44 level6 level50)
(sum level44 level7 level51)
(sum level44 level16 level60)
(sum level44 level17 level61)
(sum level44 level21 level65)
(sum level45 level4 level49)
(sum level45 level5 level50)
(sum level45 level6 level51)
(sum level45 level7 level52)
(sum level45 level16 level61)
(sum level45 level17 level62)
(sum level45 level21 level66)
(sum level46 level4 level50)
(sum level46 level5 level51)
(sum level46 level6 level52)
(sum level46 level7 level53)
(sum level46 level16 level62)
(sum level46 level17 level63)
(sum level46 level21 level67)
(sum level47 level4 level51)
(sum level47 level5 level52)
(sum level47 level6 level53)
(sum level47 level7 level54)
(sum level47 level16 level63)
(sum level47 level17 level64)
(sum level47 level21 level68)
(sum level48 level4 level52)
(sum level48 level5 level53)
(sum level48 level6 level54)
(sum level48 level7 level55)
(sum level48 level16 level64)
(sum level48 level17 level65)
(sum level49 level4 level53)
(sum level49 level5 level54)
(sum level49 level6 level55)
(sum level49 level7 level56)
(sum level49 level16 level65)
(sum level49 level17 level66)
(sum level50 level4 level54)
(sum level50 level5 level55)
(sum level50 level6 level56)
(sum level50 level7 level57)
(sum level50 level16 level66)
(sum level50 level17 level67)
(sum level51 level4 level55)
(sum level51 level5 level56)
(sum level51 level6 level57)
(sum level51 level7 level58)
(sum level51 level16 level67)
(sum level51 level17 level68)
(sum level52 level4 level56)
(sum level52 level5 level57)
(sum level52 level6 level58)
(sum level52 level7 level59)
(sum level52 level16 level68)
(sum level53 level4 level57)
(sum level53 level5 level58)
(sum level53 level6 level59)
(sum level53 level7 level60)
(sum level54 level4 level58)
(sum level54 level5 level59)
(sum level54 level6 level60)
(sum level54 level7 level61)
(sum level55 level4 level59)
(sum level55 level5 level60)
(sum level55 level6 level61)
(sum level55 level7 level62)
(sum level56 level4 level60)
(sum level56 level5 level61)
(sum level56 level6 level62)
(sum level56 level7 level63)
(sum level57 level4 level61)
(sum level57 level5 level62)
(sum level57 level6 level63)
(sum level57 level7 level64)
(sum level58 level4 level62)
(sum level58 level5 level63)
(sum level58 level6 level64)
(sum level58 level7 level65)
(sum level59 level4 level63)
(sum level59 level5 level64)
(sum level59 level6 level65)
(sum level59 level7 level66)
(sum level60 level4 level64)
(sum level60 level5 level65)
(sum level60 level6 level66)
(sum level60 level7 level67)
(sum level61 level4 level65)
(sum level61 level5 level66)
(sum level61 level6 level67)
(sum level61 level7 level68)
(sum level62 level4 level66)
(sum level62 level5 level67)
(sum level62 level6 level68)
(sum level63 level4 level67)
(sum level63 level5 level68)
(sum level64 level4 level68)

(connected l0 l2)
(fuelcost level16 l0 l2)
(connected l1 l2)
(fuelcost level21 l1 l2)
(connected l1 l3)
(fuelcost level6 l1 l3)
(connected l1 l4)
(fuelcost level5 l1 l4)
(connected l2 l0)
(fuelcost level16 l2 l0)
(connected l2 l1)
(fuelcost level21 l2 l1)
(connected l2 l3)
(fuelcost level4 l2 l3)
(connected l2 l4)
(fuelcost level17 l2 l4)
(connected l3 l1)
(fuelcost level6 l3 l1)
(connected l3 l2)
(fuelcost level4 l3 l2)
(connected l3 l4)
(fuelcost level7 l3 l4)
(connected l4 l1)
(fuelcost level5 l4 l1)
(connected l4 l2)
(fuelcost level17 l4 l2)
(connected l4 l3)
(fuelcost level7 l4 l3)

(at t0 l3)
(fuel t0 level68)
(= (total-cost) 0)

(at p0 l0)
(at p1 l1)
(at p2 l1)
(at p3 l1)
(at p4 l0)
(at p5 l0)
(at p6 l0)
(at p7 l2)
(at p8 l4)
(at p9 l1)
(at p10 l0)
)

(:goal
(and
(at p0 l3)
(at p1 l2)
(at p2 l2)
(at p3 l3)
(at p4 l1)
(at p5 l3)
(at p6 l4)
(at p7 l4)
(at p8 l2)
(at p9 l2)
(at p10 l2)
)
)
(:metric minimize (total-cost)))

; plan
1. (drive t0 l3 l2 level64 level4 level68)
   deleted: (at t0 l3) (fuel t0 level68)
   added: (at t0 l2) (fuel t0 level64)
   goals met: 0 of 11
2. (drive t0 l2 l0 level48 level16 level64)
   deleted: (at t0 l2) (fuel t0 level64)
   added: (at t0 l0) (fuel t0 level48)
   goals met: 0 of 11
3. (load p6 t0 l0)
   deleted: (at p6 l0)
   added: (in p6 t0)
   goals met: 0 of 11
4. (load p5 t0 l0)
   deleted: (at p5 l0)
   added: (in p5 t0)
   goals met: 0 of 11
5. (load p4 t0 l0)
   deleted: (at p4 l0)
   added: (in p4 t0)
   goals met: 0 of 11
6. (load p10 t0 l0)
   deleted: (at p10 l0)
   added: (in p10 t0)
   goals met: 0 of 11
7. (load p0 t0 l0)
   deleted: (at p0 l0)
   added: (in p0 t0)
   goals met: 0 of 11
8. (drive t0 l0 l2 level32 level16 level48)
   deleted: (at t0 l0) (fuel t0 level48)
   added: (at t0 l2) (fuel t0 level32)
   goals met: 0 of 11
9. (unload p10 t0 l2)
   deleted: (in p10 t0)
   added: (at p10 l2)
   goals met: 1 of 11
10. (load p7 t0 l2)
   deleted: (at p7 l2)
   added: (in p7 t0)
   goals met: 1 of 11
11. (drive t0 l2 l4 level15 level17 level32)
   deleted: (at t0 l2) (fuel t0 level32)
   added: (at t0 l4) (fuel t0 level15)
   goals met: 1 of 11
12. (unload p7 t0 l4)
   deleted: (in p7 t0)
   added: (at p7 l4)
   goals met: 2 of 11
13. (unload p6 t0 l4)
   deleted: (in p6 t0)
   added: (at p6 l4)
   goals met: 3 of 11
14. (load p8 t0 l4)
   deleted: (at p8 l4)
   added: (in p8 t0)
   goals met: 3 of 11
15. (drive t0 l4 l1 level10 level5 level15)
   deleted: (at t0 l4) (fuel t0 level15)
   added: (at t0 l1) (fuel t0 level10)
   goals met: 3 of 11
16. (load p3 t0 l1)
   deleted: (at p3 l1)
   added: (in p3 t0)
   goals met: 3 of 11
17. (load p2 t0 l1)
   deleted: (at p2 l1)
   added: (in p2 t0)
   goals met: 3 of 11
18. (load p1 t0 l1)
   deleted: (at p1 l1)
   added: (in p1 t0)
   goals met: 3 of 11
19. (load p9 t0 l1)
   deleted: (at p9 l1)
   added: (in p9 t0)
   goals met: 3 of 11
20. (unload p4 t0 l1)
   deleted: (in p4 t0)
   added: (at p4 l1)
   goals met: 4 of 11
21. (drive t0 l1 l3 level4 level6 level10)
   deleted: (at t0 l1) (fuel t0 level10)
   added: (at t0 l3) (fuel t0 level4)
   goals met: 4 of 11
22. (unload p0 t0 l3)
   deleted: (in p0 t0)
   added: (at p0 l3)
   goals met: 5 of 11
23. (unload p3 t0 l3)
   deleted: (in p3 t0)
   added: (at p3 l3)
   goals met: 6 of 11
24. (unload p5 t0 l3)
   deleted: (in p5 t0)
   added: (at p5 l3)
   goals met: 7 of 11
25. (drive t0 l3 l2 level0 level4 level4)
   deleted: (at t0 l3) (fuel t0 level4)
   added: (at t0 l2) (fuel t0 level0)
   goals met: 7 of 11
26. (unload p1 t0 l2)
   deleted: (in p1 t0)
   added: (at p1 l2)
   goals met: 8 of 11
27. (unload p2 t0 l2)
   deleted: (in p2 t0)
   added: (at p2 l2)
   goals met: 9 of 11
28. (unload p8 t0 l2)
   deleted: (in p8 t0)
   added: (at p8 l2)
   goals met: 10 of 11
29. (unload p9 t0 l2)
   deleted: (in p9 t0)
   added: (at p9 l2)
   goals met: 11 of 11
